Courses/7140/Lectures/Overview/sloc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-28 Fri 07:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CS7140 SLOC of Software</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="CS7140 Adv Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CS7140 SLOC of Software</h1>
<p>
How to predict the effort needed to produce a software?  Afterward, how to
"measure" the effort?
</p>

<p>
Much effort has gone into this.  Web search for "software metrics".
</p>

<div id="outline-container-org154d367" class="outline-2">
<h2 id="org154d367"><span class="section-number-2">1</span> A Few Quotes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6dea6f4" class="outline-3">
<h3 id="org6dea6f4"><span class="section-number-3">1.1</span> Fred Brooks</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><a href="https://amturing.acm.org/award_winners/brooks_1002187.cfm">https://amturing.acm.org/award_winners/brooks_1002187.cfm</a></li>
<li>"Adding manpower to a late software project makes it later."</li>
<li>"How does a project get to be a year behind schedule? One day at a time."</li>
<li>"Good judgment comes from experience and experience comes from bad judgment."</li>
</ol>
</div>
</div>

<div id="outline-container-org1625fca" class="outline-3">
<h3 id="org1625fca"><span class="section-number-3">1.2</span> Questions with No Answers?</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>What is the largest program/sofware ever written? (No matter how
long it took.)</li>

<li>by one person?</li>
<li>by a team? what is the size?</li>

<li>Do you know of <b>a</b> program &gt; 1000 lines that is bug-free?</li>
</ol>
</div>
</div>


<div id="outline-container-org609b5e0" class="outline-3">
<h3 id="org609b5e0"><span class="section-number-3">1.3</span> Misc</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><a href="https://www.quora.com/What-line-of-code-changed-the-world-of-programming">https://www.quora.com/What-line-of-code-changed-the-world-of-programming</a>
This line of code changed the world of low-level computer graphics:
i  = 0x5f3759df - ( i &gt;&gt; 1 );               // wtf?</li>

<li>Does programming in the Small differ from Large (Giga etc)
qualitatively, or is it just additive scale?</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org151e352" class="outline-2">
<h2 id="org151e352"><span class="section-number-2">2</span> Sizes of Some "Programs"</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>How many lines of code are there in Minecraft? Jack Bruienne, First
played Minecraft in 2011.  "I once wondered this because I was
looking for a million lines of code for a school presentation. I
concatenated all of the lines of code from Minecraft 1.9 
&#x2026; and got 285,197 lines.  I’m not sure if this is
exactly correct &#x2026;</li>

<li>(S)LOC: count of source code lines, ignoring blank lines and
comments.  Debian/Ubuntu tools {<code>bogosec, cccc, sloccount</code>}.</li>

<li><p>
The numbers below are in MLOC.  Linux numbers can be trusted, but
the other numbers are based on rumors.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1993</td>
<td class="org-left">Windows NT 3.1</td>
<td class="org-right">6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"> </td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Red Hat Linux 6.2</td>
<td class="org-right">17</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1994</td>
<td class="org-left">Windows NT 3.5</td>
<td class="org-right">10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Red Hat Linux 7.1</td>
<td class="org-right">30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1996</td>
<td class="org-left">Windows NT 4.0</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Debian 2.2</td>
<td class="org-right">56</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2000</td>
<td class="org-left">Windows 2000</td>
<td class="org-right">29</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Debian 3.0</td>
<td class="org-right">104</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2002</td>
<td class="org-left">Windows XP</td>
<td class="org-right">40</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Debian 3.1</td>
<td class="org-right">213</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2003</td>
<td class="org-left">Windows Server 2003</td>
<td class="org-right">50</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Linux kernel 2.6.0</td>
<td class="org-right">6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2008</td>
<td class="org-left">Windows 7</td>
<td class="org-right">40</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">2010</td>
<td class="org-left">Linux kernel 3.x.x</td>
<td class="org-right">13.5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">200x</td>
<td class="org-left">Gimp-2.3.8</td>
<td class="org-right">0.65</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">2011</td>
<td class="org-left">Linux kernel 3.6.x</td>
<td class="org-right">15.9</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">200x</td>
<td class="org-left">SABRE</td>
<td class="org-right">200</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">2013</td>
<td class="org-left">Linux kernel 3.9.x</td>
<td class="org-right">11 *</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">200x</td>
<td class="org-left">SAP</td>
<td class="org-right">160</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">200x</td>
<td class="org-left">Sun Solaris 7</td>
<td class="org-right">0.5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">200x</td>
<td class="org-left">IRS</td>
<td class="org-right">62</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
</ol>

<p>
[For the above, no real refs can be given, but mostly from
<a href="https://en.wikipedia.org/wiki/Source_lines_of_code">https://en.wikipedia.org/wiki/Source_lines_of_code</a>
What is included/ excluded in the count?
</p>
</div>

<div id="outline-container-org7b8e6d5" class="outline-4">
<h4 id="sloccount-usrlocalsrclinux-3.10.2-aug-2013"><a id="org7b8e6d5"></a><span class="section-number-4">2.0.1</span> sloccount /usr/local/src/linux-3.10.2 # Aug 2013</h4>
<div class="outline-text-4" id="text-sloccount-usrlocalsrclinux-3.10.2-aug-2013">
<pre class="example">
SLOC    Directory       SLOC-by-Language (Sorted)
6453062 drivers         ansic=6448301,yacc=1688,asm=1476,perl=792,lex=779,
                        sh=26
2019776 arch            ansic=1750979,asm=267172,sh=810,awk=476,pascal=231,
                        python=45,perl=33,sed=30
770378  fs              ansic=770378
580043  sound           ansic=579860,asm=183
556120  net             ansic=556024,awk=96
354424  include         ansic=351241,cpp=3141,asm=42
135562  kernel          ansic=135553,asm=9
88104   tools           ansic=80499,perl=3775,python=1810,sh=1317,yacc=432,
                        lex=257,asm=14
61376   crypto          ansic=61376
60419   mm              ansic=60419
56568   Documentation   xml=46640,ansic=5117,perl=2453,sh=915,python=907,
                        lisp=218,asm=189,awk=129
46430   security        ansic=46430
42702   scripts         ansic=26260,perl=9229,sh=2499,cpp=1821,yacc=1440,
                        lex=1006,python=447
35769   lib             ansic=35636,perl=120,awk=13
18449   block           ansic=18449
6195    ipc             ansic=6195
5407    virt            ansic=5407
2507    init            ansic=2507
1991    samples         ansic=1991
1876    firmware        asm=1660,ansic=216
567     usr             ansic=553,asm=14
0       top_dir         (none)
</pre>

<p>
Totals grouped by language
</p>

<pre class="example">
ansi-c:     10943391 (96.86%)
asm:         270759 (2.40%)
xml:          46640 (0.41%)
perl:         16402 (0.15%)
sh:            5567 (0.05%)
cpp:           4962 (0.04%)
yacc:          3560 (0.03%)
python:        3209 (0.03%)
lex:           2042 (0.02%)
awk:            714 (0.01%)
pascal:         231 (0.00%)
lisp:           218 (0.00%)
sed:             30 (0.00%)
</pre>
</div>
</div>

<div id="outline-container-org227e9ef" class="outline-4">
<h4 id="sloccount-usrlocalsrclinux-4.19-2018-oct-22"><a id="org227e9ef"></a><span class="section-number-4">2.0.2</span> sloccount /usr/local/src/linux-4.19, 2018-Oct-22</h4>
<div class="outline-text-4" id="text-sloccount-usrlocalsrclinux-4.19-2018-oct-22">
<ol class="org-ol">
<li></li>


<li>2. Before kernel build, <code>du -sh linux-4.19</code> is <code>908M</code></li>

<li>3. After kernel build, <code>du -sh linux-4.19</code> is TBD.</li>

<li><p>
4. Source Lines of Code (SLOC) Totals grouped by language
</p>

<pre class="example">
: ansic:     16756046 (97.89%)
: asm:         271828 (1.59%)
: sh:           29564 (0.17%)
: perl:         27344 (0.16%)
: python:       17875 (0.10%)
: cpp:           5063 (0.03%)
: yacc:          4648 (0.03%)
: lex:           2583 (0.02%)
: awk:           1385 (0.01%)
: ruby:            25 (0.00%)
: sed:              5 (0.00%)
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-orgcb8dd98" class="outline-4">
<h4 id="programming-in-the-small-..-giga"><a id="orgcb8dd98"></a><span class="section-number-4">2.0.3</span> Programming in the Small .. Giga</h4>
<div class="outline-text-4" id="text-programming-in-the-small-..-giga">
<ol class="org-ol">
<li>Can we define: program, software? Small, Medium, Large, &#x2026;, Giga?</li>
<li><p>
Our working/arbirary definitions:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Tiny:</td>
<td class="org-left">&#x2013; 01 KLOC;</td>
</tr>

<tr>
<td class="org-left">Small:</td>
<td class="org-left">&#x2013; 10 KLOC;</td>
</tr>

<tr>
<td class="org-left">Medium:</td>
<td class="org-left">&#x2013; 01 MLOC;</td>
</tr>

<tr>
<td class="org-left">Large:</td>
<td class="org-left">&#x2013; 10 MLOC;</td>
</tr>

<tr>
<td class="org-left">Giga:</td>
<td class="org-left">10+ MLOC</td>
</tr>
</tbody>
</table></li>
</ol>
</div>
</div>

<div id="outline-container-orgcb85f35" class="outline-3">
<h3 id="the-field-of-software-metrics"><a id="orgcb85f35"></a><span class="section-number-3">2.1</span> The Field of Software Metrics</h3>
<div class="outline-text-3" id="text-the-field-of-software-metrics">
<p>
There are books on this topic. In this course, we will discuss this
topic only in passing. Main reason for interest: Cost estimation. Main
reason for disinterest: Polemics.
</p>

<ol class="org-ol">
<li>We do not have any metrics that cannot be sabotaged.</li>
<li>Other than SLOC: Number of functions/procedures/methods;<br />
Man years<br /></li>
<li>complexity; McCabe Cyclomatic Number;
<a href="http://en.wikipedia.org/wiki/Cyclomatic_complexity">wikipedia.org
Cyclomatic<sub>complexity</sub></a> Halstead Software Science; see book on
Metrics.</li>
<li><a href="http://en.wikipedia.org/wiki/Efferent_Coupling">wikipedia.org
Efferent<sub>Coupling</sub></a> "It measures the number of data types a class
knows about. This includes inheritance, interface implementation,
parameter types, variable types, and exceptions. A large efferent
coupling can indicate that a class is unfocused. It may also indicate
brittleness, since it depends on the stability of all the types to
which it is coupled."</li>
</ol>
</div>
</div>

<div id="outline-container-org4f351f8" class="outline-3">
<h3 id="references"><a id="org4f351f8"></a><span class="section-number-3">2.2</span> References</h3>
<div class="outline-text-3" id="text-references">
<ol class="org-ol">
<li>Google Talk on how they build their software: (i)
<a href="http://www.youtube.com/watch?v=2qv3fcXW1mg">Video</a>, (ii)
<a href="http://static.googleusercontent.com/external_content/untrusted_dlcp/research.google.com/en/us/people/jeff/stanford-295-talk.pdf">PDF</a>
Recommended Watching/Reading</li>
<li><a href="http://blogs.msdn.com/b/b8/archive/2012/03/06/going-behind-the-scenes-building-windows-8.aspx">Building
Windows 8</a> Recommended Reading.</li>
<li><a href="http://2013.icse-conferences.org/Keynote">2013 ICSE conference
Keynote</a> "Does Scale Really Matter? &#x2013; Ultra-Large-Scale Systems
Seven Years after the Study" Linda Northrop is director of the
Research, Technology, and Systems Solution Program at the Software
Engineering Institute (SEI). In 2006,
<a href="http://www.sei.cmu.edu/uls/">Ultra-Large-Scale Systems</a>: The
Software Challenge of the Future (ISBN 0-9786956-0-7) documented the
results of a year-long study. Free book pdf. Recommended Reading.</li>
</ol>

<hr />

<p>
<a href="http://www.cs.wright.edu/~pmateti/copyright.html">Copyright</a> © 2013
<a href="http://www.cs.wright.edu/~pmateti">Prabhaker Mateti</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org7e2899c" class="outline-2">
<h2 id="org7e2899c"><span class="section-number-2">3</span> End</h2>
<div class="outline-text-2" id="text-3">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2018-07-26
</div>
</body>
</html>
